src/test/resources/jsonResponses/paymentInitiation/pixByPayments/paymentInitiationConsentResponsePixByPaymentId(WithoutOptional).json

{
    "data": {
        "paymentId": "TXpRMU9UQTROMWhZV2xSU1FUazJSMDl",
        "consentId": "urn:bancoex:C1DD33123",
        "creationDateTime": "2020-07-21T08:30:00Z",
        "statusUpdateDateTime": "2020-07-21T08:30:00Z",
        "status": "PDNG",
        "localInstrument": "DICT",
        "cnpjInitiator": "50685362000135",
        "payment": {
            "amount": "100000.12",
            "currency": "BRL"
        },
        "creditorAccount": {
            "ispb": "12345678",
            "issuer": "1774",
            "number": "1234567890",
            "accountType": "CACC"
        }
    },
    "links": {
        "self": "https://api.banco.com.br/open-banking/api/v1/resource"
    },
    "meta": {
        "totalRecords": 1,
        "totalPages": 1,
        "requestDateTime": "2021-05-21T08:30:00Z"
    }
}
